package cn.iwenchaos.alpha.router;

/**
 * Created by chaos
 * on 2019/2/1. 11:23
 * 文件描述：阿里 arouter 文档说明
 *
 * 1. 支持直接解析标准url进行跳转，并自动注入参数到目标页面中，支持注解方式
 * 2. 支持多模块功能使用
 * 3. 支持添加多个拦截器，自定义拦截顺序
 * 4. 支持依赖注入，可单独作为依赖注入框架使用
 * 5. 支持InstantRun
 * 6. 支持MultiDex
 * 7. 映射关系按组分类，多级管理，按需初始化
 * 8. 支持用户指定全局降级与局部降级策略
 * 9. 页面，拦截器，服务等组件均自动化注册到框架内
 * 10.支持多种方式配置转场动画
 * 11.支持获取Fragment
 * 12.完全支持Kotlin以及混编（Hybrid）
 * 13.支持第三方App加固（使用arouter-register实现自动注册）
 * 14.支持生成路由文档
 * 15.提供IDE插件便捷地关联路径和目标类
 *
 *
 *
 * 典型应用：
 * 1. 从外部URL映射到内部页面，以及参数传递与解析
 * 2. 跨模块页面跳转，模块间解耦
 * 3. 拦截跳转过程，处理登录，埋点等相关切面逻辑
 * 4. 跨模块api调用，通过控制反转来做组件解耦
 */
public class Doc {









}
